In [2]:
import pandas as pd

In [96]:
X = pd.read_csv('Datasets/Train.csv')
y = pd.read_csv('Datasets/target.csv')

In [97]:
X.rename(columns = {'room_type_x':'room_type','neighbourhood_group':'neighborhood','minimum_nights_x':'min_nights','accommodates':'space_for','maximum_nights':'max_nights'},inplace = True )

In [98]:
pd.set_option('display.max_columns', 12)

# encoding Neighborhoods as values 1-12
# Mitte = 1
# Friedrichshain-Kreuzberg = 2
# Pankow = 3                      
# Neukölln = 4                
# Charlottenburg-Wilm. = 5
# Tempelhof - Schöneberg = 6
# Lichtenberg = 7
# Treptow - Köpenick = 8
# Steglitz - Zehlendorf = 9
# Reinickendorf = 10
# Marzahn - Hellersdorf = 11
# Spandau = 12
X.replace({'Mitte':1,'Friedrichshain-Kreuzberg':2,'Pankow':3,'Neukölln':4,'Charlottenburg-Wilm.':5,'Tempelhof - Schöneberg':6,'Lichtenberg':7,'Treptow - Köpenick':8,'Steglitz - Zehlendorf':9,'Reinickendorf':10,'Marzahn - Hellersdorf':11,'Spandau':12},inplace = True)

# encoding room types as values 
# 15 Entire home/apt
# 14 Private room
# 36 shared room
X.replace({'Entire home/apt':15,'Private room':14,'Shared room':36},inplace = True)

In [114]:
#X.drop(columns = ['season','house_rules','property_type','comments'],inplace = True)

In [101]:
y.head()

    79
0   49
1   50
2   60
3  119
4   80

In [102]:
y.rename(columns = {'79':'price'},inplace = True)
y.head()

   price
0     49
1     50
2     60
3    119
4     80

In [106]:
X['bedrooms'].value_counts()

1.0     223681
2.0      43268
0.0      17773
3.0      12618
4.0       2343
5.0        936
6.0        258
8.0         82
7.0         36
12.0         4
9.0          1
Name: bedrooms, dtype: int64

In [103]:
X['price'] = y
X.head()

,room_type,neighborhood,min_nights,space_for,bathrooms,max_nights,description,bedrooms,price
0,15,3,5,2,1.0,15,"Apartment in charming Prenzlauer Berg, on the ...",1.0,49.0
1,15,6,1,3,1.0,365,Das Einzimmer-Studio-Appartement Kalckreuthstr...,0.0,50.0
2,14,2,3,2,1.0,1125,The flat is located in the city center in the ...,0.0,60.0
3,15,2,1,4,1.0,1125,What makes this listing extra special is there...,1.0,119.0
4,15,1,1,2,1.0,1125,Modern furnished Loft in the heart of Berlin M...,0.0,80.0

In [107]:
X.dropna(inplace = True)

In [52]:
#X.to_csv('Airbnb.csv',index = False)

In [ ]:
y = pd.DataFrame(X['price'])

In [115]:
X.drop(columns = 'price',inplace = True)
X.head()

,room_type,neighborhood,min_nights,space_for,bathrooms,max_nights,description,bedrooms
0,15,3,5,2,1.0,15,"Apartment in charming Prenzlauer Berg, on the ...",1.0
1,15,6,1,3,1.0,365,Das Einzimmer-Studio-Appartement Kalckreuthstr...,0.0
2,14,2,3,2,1.0,1125,The flat is located in the city center in the ...,0.0
3,15,2,1,4,1.0,1125,What makes this listing extra special is there...,1.0
4,15,1,1,2,1.0,1125,Modern furnished Loft in the heart of Berlin M...,0.0

In [116]:
print(f"Shape of Features: {X.shape}")
print(f"Shape of target: {y.shape}")

Shape of Features: (299626, 8)
Shape of target: (299626, 1)

In [117]:
X.to_csv('Airbnb.csv',index = False)
y.to_csv('Airbnb_target.csv',index = False)